#三元九运速算法

#上元甲子一宫连，中元起巽下兑间；上五中二下八女，男逆女顺起根源。

#按后天八卦分九个宫：1、北宫：坎（水）；2、西南宫：坤（土）；3、东宫：震（木）；4、东南宫：巽（木）；
#5、中宫：男坤女艮（土）；6、西北宫：乾（金）；7、西宫：兑（金）；8、东北宫：艮（土）；9、南宫：离（火）

#天干为甲、乙、丙、丁、戊、己、庚、辛、壬、癸
tg={4:'甲',5:'乙',6:'丙',7:'丁',8:'戊',9:'己',0:'庚',1:'辛',2:'壬',3:'癸'}
#地支为子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥
dz={4:'子',5:'丑',6:'寅',7:'卯',8:'辰',9:'巳',10:'午',11:'未',0:'申',1:'酉',2:'戌',3:'亥'}
#男命
nan={1:'坎水',0:'坤土',8:'震木',7:'巽木',6:'坤土',5:'乾金',4:'兑金',3:'艮土',2:'离火'}
#女命
nv={6:'坎水',7:'坤土',8:'震木',0:'巽木',1:'艮土',2:'乾金',3:'兑金',4:'艮土',5:'离火'}

#0000年是庚申年，男命是坤土年，女命是巽木年，用本年或者出生年除以9，余数对应的上表就是年命。
print('请输入年份')
year=int(input())
print(str(year)+'年为'+tg[year%10]+dz[year%12]+'年，男命为'+nan[year%9]+'，女命为'+nv[year%9])
